In [2]:
import pandas as pd
import numpy as np

prets = pd.read_csv('prets.csv')
display(prets)

,identifiant,ville,CP,revenu,remboursement,duree,type,taux
0,0,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168
1,1,PARIS,75009,5310.0,240.00,64,automobile,3.701
2,1,PARIS,75009,5310.0,1247.85,300,immobilier,1.173
3,2,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972
4,3,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014
...,...,...,...,...,...,...,...,...
239,224,PARIS,75008,5118.0,1248.79,300,immobilier,1.206
240,224,PARIS,75008,5118.0,238.20,25,automobile,3.423
241,225,BORDEAUX,33100,2356.0,876.43,180,immobilier,1.172
242,226,PARIS,75002,5098.0,2910.96,240,immobilier,1.140
243,227,PARIS,75015,2348.0,434.38,300,immobilier,1.157

In [3]:
prets.groupby('ville').sum()

,identifiant,CP,revenu,remboursement,duree,type,taux
ville,,,,,,,
BORDEAUX,1718,531800,50816.0,15330.59,3660,immobilierimmobilierimmobilierimmobilierimmobi...,18.767
LYON,2833,1932134,95354.0,26064.67,6251,immobilierimmobilierimmobilierimmobilierimmobi...,38.918
MARSEILLE,7946,975732,145926.0,40895.72,16420,immobilierimmobilierimmobilierimmobilierimmobi...,92.538
NICE,2375,129100,85288.0,23544.24,4460,immobilierimmobilierimmobilierimmobilierimmobi...,27.706
PARIS,9849,5776019,335459.0,94052.61,16686,automobileimmobilierimmobilierimmobilierimmobi...,100.073
TOULOUSE,3162,843300,75617.0,19286.18,5643,immobilierimmobilierimmobilierimmobilierimmobi...,38.217

In [4]:
prets.groupby(['ville', 'type']).sum()

                      identifiant       CP    revenu  remboursement  duree  \
ville     type
BORDEAUX  immobilier         1718   531800   50816.0       15330.59   3660
LYON      automobile          360   207018   11531.0         788.80    131
          immobilier         2473  1725116   83823.0       25275.87   6120
MARSEILLE automobile          404    39031    5842.0         839.60    160
          immobilier         7542   936701  140084.0       40056.12  16260
NICE      automobile          187    12300    7607.0         612.80     80
          immobilier         2188   116800   77681.0       22931.44   4380
PARIS     automobile          612   375054   22834.0        1426.60    246
          immobilier         9237  5400965  312625.0       92626.01  16440
TOULOUSE  automobile          442    93400    7803.0         718.80    183
          immobilier         2720   749900   67814.0       18567.38   5460

                        taux
ville     type
BORDEAUX  immobilier  18.767
LYON      automobile  10.083
          immobilier  28.835
MARSEILLE automobile   9.535
          immobilier  83.003
NICE      automobile   6.104
          immobilier  21.602
PARIS     automobile  17.271
          immobilier  82.802
TOULOUSE  automobile   9.868
          immobilier  28.349

In [5]:
prets.groupby(['ville', 'type'])['remboursement'].sum()

ville      type
BORDEAUX   immobilier    15330.59
LYON       automobile      788.80
           immobilier    25275.87
MARSEILLE  automobile      839.60
           immobilier    40056.12
NICE       automobile      612.80
           immobilier    22931.44
PARIS      automobile     1426.60
           immobilier    92626.01
TOULOUSE   automobile      718.80
           immobilier    18567.38
Name: remboursement, dtype: float64

In [8]:
prets.groupby('ville').agg({'remboursement': ['count', 'sum', 'mean'],

    'revenu': 'max'})

          remboursement                         revenu
                  count       sum         mean     max
ville
BORDEAUX             16  15330.59   958.161875  3691.0
LYON                 28  26064.67   930.881071  4771.0
MARSEILLE            75  40895.72   545.276267  2962.0
NICE                 21  23544.24  1121.154286  5987.0
PARIS                77  94052.61  1221.462468  6807.0
TOULOUSE             27  19286.18   714.302963  3993.0

In [12]:
data = prets.pivot_table(index='ville', columns='type', values='remboursement', aggfunc='sum')
data

type       automobile  immobilier
ville
BORDEAUX          NaN    15330.59
LYON            788.8    25275.87
MARSEILLE       839.6    40056.12
NICE            612.8    22931.44
PARIS          1426.6    92626.01
TOULOUSE        718.8    18567.38

In [13]:
data = data.reset_index()
data

type      ville  automobile  immobilier
0      BORDEAUX         NaN    15330.59
1          LYON       788.8    25275.87
2     MARSEILLE       839.6    40056.12
3          NICE       612.8    22931.44
4         PARIS      1426.6    92626.01
5      TOULOUSE       718.8    18567.38

In [14]:
data.melt(id_vars='ville', value_vars=['automobile', 'immobilier'])

        ville        type     value
0    BORDEAUX  automobile       NaN
1        LYON  automobile    788.80
2   MARSEILLE  automobile    839.60
3        NICE  automobile    612.80
4       PARIS  automobile   1426.60
5    TOULOUSE  automobile    718.80
6    BORDEAUX  immobilier  15330.59
7        LYON  immobilier  25275.87
8   MARSEILLE  immobilier  40056.12
9        NICE  immobilier  22931.44
10      PARIS  immobilier  92626.01
11   TOULOUSE  immobilier  18567.38